Котельников_АБ_70153995/src/Documents/ЗакрытиеВакансии/ЗакрытиеВакансии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакрытиеВакансии</name>
  <basedOn>Document.Вакансия</basedOn>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>DocumentRef.Вакансия</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВакансии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаЗакрытия</name>
    <type>
      <types>EnumRef.ПричиныЗакрытияВакансий</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПричины</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаВакансию</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

Котельников_АБ_70153995/src/Documents/ЗакрытиеВакансии/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Вакансия") Тогда
		// Заполнение шапки
		Должность = ДанныеЗаполнения.Должность;
		НаименованиеВакансии = ДанныеЗаполнения.НаименованиеВакансии;
		ОтветственныйЗаВакансию = ДанныеЗаполнения.ОтветственныйЗаВакансию;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Вакансия = ДанныеЗаполнения.Ссылка;
	КонецЕсли;

КонецПроцедуры
